{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "hidden_size": 2048,
  "intermediate_size": 5632,
  "num_attention_heads": 32,
  "num_hidden_layers": 22,
  "num_key_value_heads": 4,
  "vocab_size": 32000,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "tie_word_embeddings": true,
  "model_type": "llama"
}